var products = {
	product_00 : [
		["屏大影院", "周末", "新品特惠", "32寸电视机", "智能网络"],
		["USB高清解", "芒果TV在线", "抢购价", "USB解码", "32英寸", "10核", "TCL品牌日"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["智能操作系统", "金色外观", "三星屏幕", "客厅爆款", "八核配置", "限时特惠"],
		["限时特惠", "热销爆款", "4K全高清", "六核智能", "14核4K", "YUNOS", "64位处理器"],
		["YUNOS", "微信电视", "4k超清", "64位真4K", "10核机芯", "V字黑釉底座", "4K超清"],
		["64位14核", "海量影视", "人气爆款", "限时特惠", "真4K屏", "65吋巨屏", "4K超清视界"],
		["55寸旗舰", "4K机皇", "曲面机皇", "轻薄4K"]
	],
	product_01 : [
		["高性价比", "纳米自洁釉", "盖板易拆", "领券更优惠", "全国联保", "咨询大惊喜"],
		["全自动感应", "即热式功能", "智能护理", "官方正品", "高效节水", "立减300", "官方正品"],
		["3秒速冲", "送角阀软管", "12大中心仓", "蹲坐两用", "领券减50", "全国联保"],
		["德国品牌", "加购收藏", "加长型缸体", "喷射虹吸", "家装狂欢节", "AB1287", "领券再减", "千城入户"],
		["强劲冲力", "包安装", "土豪直接付款", "咨询在线客服", "赠送原厂配件", "新聚汇", "吸力哥"],
		["覆盖区域内", "指定1800", "晒图返10元", "1300城免", "久坐舒适", "晒图送20元", "摩普智能马桶"],
		["送空调扇", "咨询大惊喜", "节水小管家", "高端大气", "科勒授权", "超旋风系列"]
	],
	product_02 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["多功能扶手", "彼爱专利产品", "国际设计师", "进口头层牛皮", "经典爆款", "可拆洗设计"],
		["高档超柔绒布", "进口橡木框架", "欧洲白蜡木", "北美黑胡桃", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_03 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_04 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_05 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_06 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_07 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_08 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_09 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_10 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_11 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_12 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_13 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	],
	product_14 : [
		["热卖推荐", "高档户型客厅", "16CM坐垫", "匠心独运", "大小户型沙发"],
		["8.23预售", "热销爆款", "高档进口牛皮", "三位可躺", "北美进口橡木", "全香樟实木"],
		["可拆洗", "4级抗污", "多功能", "全实木雕刻", "3D玛雅绒"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"],
		["不要赠品", "新品上市", "4K硬屏", "领100元券", "智能高清", "8月特惠"]
	]
};

// console.log(products.product_00);
// var str = "";
// for(var i = 0; i < products.product_00.length; i++) {
// 	for(var j = 0; j < products.product_00[i].length; j++) {
// 		str += products.product_00[i][j] + "  ";
// 	}
// 	str += "<br>";
// }
// console.log(str);

/*
var exampleObj = {
	info: "information",
	inner: {
		id: 0,
		value: 100
	},
	arr: ["one", "two", "three"]
};
console.log(exampleObj.info);
console.log(exampleObj.inner);
console.log(exampleObj.arr);
*/


/*
var info=[
	{
		"name":"最近想跳河",
		"interst":["历史","美食"],
		"wife":{"name":"a.wen","interst":["旅游","美食","教育人"]}
	},
	{
		"name":"0000",
		"interst":["5555","8888"],
		"wife":{"name":"444","interst":["1111","55","999"]}
	}
];

for(var p in info){
    console.log(info[p]);
    console.log("姓名："+info[p].name)
    for(var i in info[p].interst){
        console.log("爱好："+info[p].interst[i]);
    }
    console.log(info[p].wife);
    console.log("老婆的名字："+info[p].wife.name);
    for(var j in info[p].wife.interst){
        console.log("老婆的爱好："+info[p].wife.interst[j])
    }
}
*/
